; Используя команды работы со стеком в массиве, состоящем из 10 положительных чисел, размером в слово, для каждого элемента массива найти ближайший больший слева и записать их на соответствующие места в результирующий массив. Если таких элементов нет, записать -1.
; Вывести элементы результирующего массив в одной строке через запятую и пробел
; Для ввода и вывода использовать функции scanf и printf.

; Архитектура 64-х разрядная

; Пример 1:
; Ввод
; Вывод
; 4 5 2 10 8 9 3 7 6 1
; -1, -1, 5, -1, 10, 10, 9, 9, 7, 6
